//
//  File.swift
//  cafe
//
//  Created by 楊仁翰 on 2017/3/31.
//  Copyright © 2017年 Renhen Yang. All rights reserved.
//

import Foundation
class data {
    static var cafe=[
        "c01.美式咖啡":
            ["cafe1","$ 50","50","很秋條的飲料"],
        "c02.原味拿鐵":
            ["cafe1","$ 65","65","很秋條的飲料"],
        "c03.抹茶拿鐵":
            ["cafe1","$ 65","65","很秋條的飲料"],
        "c04.榛果拿鐵":
            ["cafe1","$ 70","70","很秋條的飲料"],
        "c05.香草拿鐵":
            ["cafe1","$ 70","70","很秋條的飲料"],
        "c06.卡布奇諾":
            ["cafe1","$ 70","70","很秋條的飲料"],
        "c07.摩卡咖啡":
            ["cafe1","$ 70","70","很秋條的飲料"],
        "c08.焦糖瑪奇朵":
            ["cafe1","$ 70","70","很秋條的飲料"]
    ]
    
    static var milk=[
        "m01.錫蘭鮮奶茶":
            ["milk1","$ 90","90","很秋條的飲料"],
        "m02.伯爵鮮奶茶":
            ["milk1","$ 50","50","很秋條的飲料"],
        "m03.茶花綠鮮奶茶":
            ["milk1","$ 50","50","很秋條的飲料"],
        "m04.碳香烏龍鮮奶茶":
            ["milk1","$ 50","50","很秋條的飲料"],
        "m05.普洱鮮奶茶":
            ["milk1","$ 50","50","很秋條的飲料"],
        "m06.白玉珍珠鮮奶茶":
            ["milk1","$ 55","55","很秋條的飲料"],
        "m07.椰果鮮奶茶":
            ["milk1","$ 55","55","很秋條的飲料"],
        "m08.巧克力鮮奶茶":
            ["milk1","$ 50","50","很秋條的飲料"],
        "m09.台灣綠鮮奶茶":
            ["milk1","$ 55","55","很秋條的飲料"],
        "m10.錫蘭珍珠鮮奶茶":
            ["milk1","$ 55","55","很秋條的飲料"],
        "m11.伯爵珍珠鮮奶茶":
            ["milk1","$ 55","55","很秋條的飲料"]
    ]
    
    static var tea=[
        "t01.台灣綠茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t02.茶花綠茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t03.烏龍綠茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t04.錫蘭紅茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t05.伯爵紅茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t06.文山青茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t07.金萱烏龍茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t08.四季烏龍茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t09.碳香烏龍茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t10.阿里山冰茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t11.普耳茶":
            ["tea1","$ 25","25","很秋條的飲料"],
        "t12.藍莓果茶":
            ["tea1","$ 35","35","很秋條的飲料"]
        
    ]
    
    static var fruittea=[
        "fr01.蜜茶":
            ["fruittea1","$ 30","30","很秋條的飲料"],
        "fr02.檸檬蘆薈":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr03.蜂蜜蘆薈":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr04.蜂蜜檸檬":
            ["fruittea1","$ 35","35","很秋條的飲料"],
        "fr05.養樂多綠茶":
            ["fruittea1","$ 45","45","很秋條的飲料"],
        "fr06-1.葡萄柚綠茶":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr06-2.葡萄柚青茶":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr07-1.梅子綠茶":
            ["fruittea1","$ 35","35","很秋條的飲料"],
        "fr07-2.梅子紅茶":
            ["fruittea1","$ 35","35","很秋條的飲料"],
        "fr07-3.梅子烏龍":
            ["fruittea1","$ 35","35","很秋條的飲料"],
        "fr08-1.檸檬綠茶":
            ["fruittea1","$ 35","35","很秋條的飲料"],
        "fr08-2.檸檬紅茶":
            ["fruittea1","$ 35","35","很秋條的飲料"],
        "fr08-3.檸檬梅子茶":
            ["fruittea1","$ 35","35","很秋條的飲料"],
        "fr09-1.鳳梨綠茶":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr09-2.鳳梨紅茶":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr09-3.鳳梨青茶":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr10-1.白玉葡萄柚綠茶":
            ["fruittea1","$ 45","45","很秋條的飲料"],
        "fr10-2.白玉葡萄柚青茶":
            ["fruittea1","$ 45","45","很秋條的飲料"],
        "fr11-1.百香綠茶":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr11-2.百香紅茶":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr11-3.百香檸檬":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr11-4.百香鳳梨":
            ["fruittea1","$ 40","40","很秋條的飲料"],
        "fr12.椰果檸檬":
            ["fruittea1","$ 35","35","很秋條的飲料"]
    ]
    
    static var flowertea=[
        "fl01.薰衣洛神飲":
            ["tea1","$ 80","80","很秋條的飲料"],
        "fl02.金盞玫瑰飲":
            ["tea1","$ 80","80","很秋條的飲料"],
        "fl03.鮮橙酸甜飲":
            ["tea1","$ 90","80","很秋條的飲料"],
        "fl04.紫蘇薑茶飲":
            ["tea1","$ 80","80","很秋條的飲料"],
        "fl05.洋甘菊碧綠":
            ["tea1","$ 80","80","很秋條的飲料"],
        "fl06.迷迭香茅飲":
            ["tea1","$ 80","80","很秋條的飲料"],
        "fl07.檸香梅子":
            ["tea1","$ 80","80","很秋條的飲料"],
        "fl08.玫瑰碧綠":
            ["tea1","$ 80","80","很秋條的飲料"],
        "fl09.紅棗茶":
            ["tea1","$ 65","65","很秋條的飲料"],
        "fl10.蘋果茶":
            ["tea1","$ 65","65","很秋條的飲料"]
    ]
    static var food=[
        "fo01-1.原味泡芙":
            ["food1","$ 20","20","很秋條的飲料"],
        "fo01-2.紅心芭樂泡芙":
            ["food1","$ 20","20","很秋條的飲料"],
        "fo02.蛋糕捲（紅心芭樂）":
            ["food1","$ 25","25","很秋條的飲料"],
        "fo03-1.厚片吐司（巧克力）":
            ["food1","$ 30","30","很秋條的飲料"],
        "fo03-2.厚片吐司（草莓）":
            ["food1","$ 30","30","很秋條的飲料"],
        "fo03-2.厚片吐司（奶油）":
            ["food1","$ 30","30","很秋條的飲料"],
        "fo03-2.厚片吐司（花生）":
            ["food1","$ 30","30","很秋條的飲料"],
        "fo03-2.厚片吐司（蒜味）":
            ["food1","$ 30","30","很秋條的飲料"]
    ]
    
}

struct Section {
    var type: String!
    var catergories: [String]!
//    var expanded: Bool!
    
    init(type: String, catergories: [String]) {
        self.type = type
        self.catergories = catergories
//        self.expanded = expanded
    }
}



